In [15]:
import pandas as pd

data1 = {"Emp id":["E01","E02","E03","E04","E05","E06"],
        "Name":["Ram","Shyam","Rahul","Vishal","Ravi","john"],
        "Age":[34,56,23,44,32,36]}

data2 = {"Emp id":["E01","E02","E03","E04","E05","E06"],
        "Salary":[45000,56000,34000,30000,50000,62000]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print()
print(df2)

  Emp id    Name  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03   Rahul   23
3    E04  Vishal   44
4    E05    Ravi   32
5    E06    john   36

  Emp id  Salary
0    E01   45000
1    E02   56000
2    E03   34000
3    E04   30000
4    E05   50000
5    E06   62000

In [8]:
print(pd.merge(df1,df2,on = "Emp id"))

  Emp id    Name  Age  Salary
0    E01     Ram   34   45000
1    E02   Shyam   56   56000
2    E03   Rahul   23   34000
3    E04  Vishal   44   30000
4    E05    Ravi   32   50000
5    E06    john   36   62000

In [9]:
print(pd.merge(left = df1,right = df2 ,on = "Emp id", how = "right"))

  Emp id    Name  Age  Salary
0    E01     Ram   34   45000
1    E02   Shyam   56   56000
2    E03   Rahul   23   34000
3    E04  Vishal   44   30000
4    E05    Ravi   32   50000
5    E06    john   36   62000

In [17]:
print(pd.join(df1,df2))

AttributeError: module 'pandas' has no attribute 'join'

In [12]:
import pandas as pd

data1 = {"Emp id":["E01","E02","E03","E04","E05","E06"],
        "Name":["Ram","Shyam","Rahul","Vishal","Ravi","john"],
        "Age":[34,56,23,44,32,36]}

data2 = {"Emp id":["E07","E08","E09","E10","E11","E12"],
        "Name":["bittu","chintu","chotu","bunty","golu","karan"],
        "Age":[34,56,23,44,32,36]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [13]:
print(pd.concat([df1,df2]))

  Emp id    Name  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03   Rahul   23
3    E04  Vishal   44
4    E05    Ravi   32
5    E06    john   36
0    E07   bittu   34
1    E08  chintu   56
2    E09   chotu   23
3    E10   bunty   44
4    E11    golu   32
5    E12   karan   36